# ============================================
# Martin – macOS setup (Homebrew Bundle)
# Source of truth: Brewfile
# Install:  brew bundle --file Brewfile
# Cleanup:  brew bundle cleanup --file Brewfile
# ============================================

# ---------- TAPS ----------
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "roshie548/tap"
tap "slp/krun"
tap "vitorgalvao/tiny-scripts"


# ============================================
# CLI / BASIC
# ============================================
brew "bash"
brew "curl"
brew "wget"
brew "tree"

brew "python@3.14"
brew "bpython"

brew "htop"
brew "bpytop"
brew "bandwhich"
brew "dua-cli"
brew "dust"
brew "midnight-commander"

brew "dockutil"
brew "m-cli"

brew "ripgrep"
brew "rsync"

brew "speedtest"           # (nahrádza speedtest-cli)

# Utilities / helpers
brew "ossp-uuid"
brew "parallel"
brew "pandoc"
brew "imagemagick"
brew "ffmpeg"

# Bundle helpers
brew "mas"
brew "vitorgalvao/tiny-scripts/cask-repair"

# Proxmox helper
brew "roshie548/tap/proxmux"


# ============================================
# NETWORK / SECURITY (CLI)
# ============================================
brew "nmap"
brew "mtr"
brew "gping"
brew "cfssl"


# ============================================
# MEDIA (CLI + GUI)
# ============================================
brew "mkvtoolnix"

cask "iina"
cask "spotify"
cask "plex"
cask "plexamp"
cask "mkvtoolnix-app"
cask "audacity"
cask "mediainfoex"
cask "tinymediamanager"


# ============================================
# CLEANING / MAINTENANCE
# ============================================
cask "onyx"
cask "pearcleaner"
cask "cleanupbuddy"
cask "daisydisk"


# ============================================
# WORK WITH FILES / TERMINAL / SYNC
# ============================================
cask "warp"
cask "termius"
cask "cloudmounter"
cask "keka"

cask "nextcloud"
cask "syncthing-app"


# ============================================
# DESKTOP ENHANCEMENT
# ============================================
cask "alt-tab"
cask "default-folder-x"
cask "domzilla-caffeine"
cask "magicquit"
cask "last-window-quits"
cask "itsycal"
cask "jordanbaird-ice@beta"


# ============================================
# SECURITY / PRIVACY
# ============================================
cask "1password"
cask "alienator88-sentinel"
cask "protonvpn"
cask "lulu"


# ============================================
# TOOLS
# ============================================
cask "mist"
cask "balenaetcher"
cask "db-browser-for-sqlite"
cask "deepl"
cask "drawio"
cask "espanso"
cask "ganttproject"
cask "overkill"
cask "openvisualtraceroute"

# macOS / FS
cask "macfuse"

# Docker / virtualization
cask "orbstack"

# Wireshark
cask "wireshark-app"

# Adobe (heavy)
cask "adobe-creative-cloud"

# Fonts
cask "font-ubuntu-sans"
cask "font-ubuntu-sans-mono"
cask "font-work-sans"


# ============================================
# BROWSERS
# ============================================
cask "firefox"
cask "brave-browser"


# ============================================
# OFFICE / PRODUCTIVITY
# ============================================
cask "obsidian"
cask "onlyoffice"

# Microsoft Office – v generated máš jednotlivé appky
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"

# Mail
cask "readdle-spark"

# Tax
cask "wiso-steuer-2025"
cask "wiso-steuer-2026"


# ============================================
# DEV TOOLS
# ============================================
cask "visual-studio-code"
cask "openinterminal"
cask "imazing-profile-editor"
cask "pycharm"


# ============================================
# QUICKLOOK / INSPECTION
# ============================================
cask "qlcolorcode"
cask "apparency"
cask "suspicious-package"
cask "glance-chamburr"


# ============================================
# TeX
# ============================================
cask "basictex"
cask "texshop"


# ============================================
# MAS (App Store)
# ============================================

# Social
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997

# Safari extensions / web
mas "1Password for Safari", id: 1569813296
mas "Tampermonkey Classic", id: 1482490089
mas "Obsidian Web Clipper", id: 6720708363

# Geocaching
mas "Raccoon - Geocaching Tool", id: 424398764
mas "iCaching", id: 420484346

# Utilities / work
mas "Actions", id: 1586435171
mas "Magnet", id: 441258766
mas "Paste Plain Text", id: 1407015686
mas "OwlOCR", id: 6462355119
mas "Paprika Recipe Manager 3", id: 1303222628
mas "finanzblick", id: 993109868
mas "WireGuard", id: 1451685025
mas "Home Assistant", id: 1099568401
mas "Keepa - Price Tracker", id: 1533805339

# Apple iWork
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694


# ============================================
# VS CODE EXTENSIONS (optional, but you have them)
# ============================================
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "dzhavat.css-flexbox-cheatsheet"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "openai.chatgpt"
vscode "pawelborkar.jellyfish"
vscode "pdconsec.vscode-print"
vscode "pinegrow.piny"
vscode "ritwickdey.liveserver"
vscode "sidthesloth.html5-boilerplate"
vscode "wayou.vscode-todo-highlight"
vscode "xdebug.php-debug"
vscode "yutengjing.vscode-archive"
vscode "zignd.html-css-class-completion"
vscode "zobo.php-intellisense"
