# Interactive Brewfile - Generated
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "bash"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "dockutil"
brew "mas"
brew "python@3.13"
brew "git"
cask "visual-studio-code"
cask "pycharm"
cask "orbstack"
cask "warp"
cask "termius"
cask "brave-browser"
cask "firefox"
cask "google-chrome"
cask "1password"
cask "protonvpn"
cask "lulu"
cask "obsidian"
